Обработки/Reports/_ЖурналПорученийОтКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЖурналПорученийОтКлиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЖурналПорученийОтКлиентов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Журнал поручений от клиентов",
		"0.22",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 					ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 					ЭтотОбъект.Период.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрНачалоПериода", 				Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрКонецПериода", 				Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		                                                                          	
	СтрОтбор = "";
	Если ЭтотОбъект.РежимОтбора = 1 Тогда
		СтрОтбор = "Счет доверительного управления: " + СокрЛП(ЭтотОбъект.СчетДоверительногоУправления);		
	ИначеЕсли ЭтотОбъект.РежимОтбора = 2 Тогда
		СтрОтбор = "Лицензия: " + СокрЛП(ЭтотОбъект.ВидДеятельности);		
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ИмяВременнойТаблицы = "_СчетаДоверительногоУправления";
	ОтборСчетовДУ = Новый Структура("Организация", ЭтотОбъект.Организация);
	Если РежимОтбора = 1 Тогда
		ПоместитьСчетДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицы);		
	ИначеЕсли РежимОтбора = 2 Тогда
		ОтборСчетовДУ.Вставить("ВидДеятельности", ЭтотОбъект.ВидДеятельности);
	КонецЕсли;                                                                	
	
	Если РежимОтбора <> 1 Тогда		
		Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, 
													ЭтотОбъект.Период.ДатаОкончания, 
													ОтборСчетовДУ, 
													"_СчетаДоверительногоУправления");
	КонецЕсли;												
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрОтбор", 						СтрОтбор);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеОрганизации", 		ПолучитьНаименованиеОрганизации());
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);

	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
		
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
		
	КонецЕсли; 

	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей,,,, Новый Структура("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц));
	
КонецПроцедуры

Процедура ПоместитьСчетДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ИмяВременнойТаблицы
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "_ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьНаименованиеОрганизации()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
	
	Запрос.УстановитьПараметр("КонецПериода", 	ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", 		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.КраткоеНаименованиеПоУставу;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции
